# Restaurant Order Analysis
Analyze order data to identify the most and least popular menu items and types of cuisine

## Objectives

#####  1-Explore the menu items table to get an idea of what's on the new menu 
#####  2-Explore the order details table to get an idea of the data tha's been collected.
##### 3-USE both tables to understand how customers are reacting to the new menu.

## Connecting to our MySQL database

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
%sql mysql+pymysql://root:omar123@127.0.0.1:3306/restaurant_db

'Connected: root@restaurant_db'

### 1. View the menu_items table and write a query to find the number of items on the menu

In [3]:
%%sql
select count(*) from menu_items

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
1 rows affected.

[(32,)]

### How many dishes are in each category?

In [4]:
%%sql
select item_name as Cheapest_and_highest ,price
from menu_items as mi
where mi.price <= 5 or mi.price >=19.95;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
2 rows affected.

[('Edamame', Decimal('5.00')), ('Shrimp Scampi', Decimal('19.95'))]

### What is the average dish price within each category?

In [5]:
%%sql
# Add your code here
select distinct category , count(item_name),avg(price)
from menu_items
group by category;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
4 rows affected.

[('American', 6, Decimal('10.066667')),
 ('Asian', 8, Decimal('13.475000')),
 ('Mexican', 9, Decimal('11.800000')),
 ('Italian', 9, Decimal('16.750000'))]

### How many Italian dishes are on the menu? What are the least and most expensive Italian dishes on the menu?

In [6]:
%%sql
select item_name,price,category from menu_items 
where price = (select max(price)from menu_items where category like "Italian" )and category like "Italian";
select item_name,price,category from menu_items 
where price = (select MIN(price) from menu_items where category like "Italian" ) and category like "Italian";

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
1 rows affected.
2 rows affected.

[('Spaghetti', Decimal('14.50'), 'Italian'),
 ('Fettuccine Alfredo', Decimal('14.50'), 'Italian')]

### View the order_details table. What is the date range of the table?

In [7]:
%%sql

select MAx(order_date),min(order_date)
from order_details ;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
1 rows affected.

[(datetime.date(2023, 3, 31), datetime.date(2023, 1, 1))]

### How many orders were made within this date range? How many items were ordered within this date range?

In [8]:
%%sql

SELECT count(order_details_id),count( distinct order_id)
from order_details;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
1 rows affected.

[(12234, 5370)]

### Which orders had the most number of items?

In [9]:
%%sql

select count(item_id) as number_of_items ,order_id
from order_details
group by order_id
order by number_of_items desc
limit 15;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
15 rows affected.

[(14, 443),
 (14, 1957),
 (14, 2675),
 (14, 4305),
 (14, 3473),
 (14, 330),
 (14, 440),
 (13, 1569),
 (13, 3583),
 (13, 1685),
 (13, 2126),
 (13, 1274),
 (13, 2725),
 (13, 2075),
 (13, 1734)]

### How many orders had more than 12 items?

In [10]:
%%sql
select count(*) from 
(select count(item_id) as number_of_items ,order_id
from order_details
group by order_id
having number_of_items >12
order by number_of_items desc) as subquery

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
1 rows affected.

[(20,)]

### What were the least and most ordered items?  What categories were they in?

In [11]:
%%sql
select count(item_id) as number_items,mi.item_name,mi.category
from menu_items as mi 
join order_details as od 
on mi.menu_item_id=od.item_id
group by mi.item_name ,mi.category
order by number_items desc
limit 5 ;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
5 rows affected.

[(622, 'Hamburger', 'American'),
 (620, 'Edamame', 'Asian'),
 (588, 'Korean Beef Bowl', 'Asian'),
 (583, 'Cheeseburger', 'American'),
 (571, 'French Fries', 'American')]

### What were the top 5 orders that spent the most money?

In [12]:
%%sql
select sum(price) ,od.order_id 
from menu_items as mi 
join order_details as od 
on mi.menu_item_id=od.item_id
group by od.order_id 
order by sum(price) desc
limit 5 
;

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
5 rows affected.

[(Decimal('192.15'), 440),
 (Decimal('191.05'), 2075),
 (Decimal('190.10'), 1957),
 (Decimal('189.70'), 330),
 (Decimal('185.10'), 2675)]

### View the details of the highest spend order. Which specific items were purchased?

In [13]:
%%sql 
select od.order_id ,mi.category,COUNT(od.item_id)
from menu_items as mi 
join order_details as od 
on mi.menu_item_id=od.item_id
where od.order_id = 440
group by mi.category
order by COUNT(od.item_id) desc

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
4 rows affected.

[(440, 'Italian', 8),
 (440, 'Mexican', 2),
 (440, 'American', 2),
 (440, 'Asian', 2)]

### View the details of the highest spend order. Which specific items were purchased?

In [14]:
%%sql 
select od.order_id ,mi.category,COUNT(od.item_id)
from menu_items as mi 
join order_details as od 
on mi.menu_item_id=od.item_id
where od.order_id in (440,2075,1957,330,2675)
group by od.order_id,mi.category
order by  od.order_id

 * mysql+pymysql://root:***@127.0.0.1:3306/restaurant_db
20 rows affected.

[(330, 'American', 1),
 (330, 'Asian', 6),
 (330, 'Italian', 3),
 (330, 'Mexican', 4),
 (440, 'American', 2),
 (440, 'Asian', 2),
 (440, 'Italian', 8),
 (440, 'Mexican', 2),
 (1957, 'American', 3),
 (1957, 'Asian', 3),
 (1957, 'Italian', 5),
 (1957, 'Mexican', 3),
 (2075, 'American', 1),
 (2075, 'Asian', 3),
 (2075, 'Italian', 6),
 (2075, 'Mexican', 3),
 (2675, 'American', 3),
 (2675, 'Asian', 3),
 (2675, 'Italian', 4),
 (2675, 'Mexican', 4)]

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>